---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BuildingPadNoSurfaceError
source: html/4d6b6693-b72d-437e-672d-40f67a7a6625.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BuildingPadNoSurfaceError Property

A Pad can't extend beyond the edge of a Toposurface.

## Syntax (C#)
```csharp
public static FailureDefinitionId BuildingPadNoSurfaceError { get; }
```